# Melt in Pandas

In [10]:
import pandas as pd
df = pd.read_csv("E:\Python\ok\Book4.csv")
df

         day  Nashik  Mumbai  Pune
0     Monday      32      75    41
1    Tuesday      30      77    43
2  Wednesday      28      75    45
3   Thursday      22      82    38
4     Friday      30      83    30
5   Saturday      20      81    45
6     Sunday      25      77    47

In [11]:
# melt will specifies that value on id_vars denoted
df1 = pd.melt(df, id_vars=["day"])
df1

          day variable  value
0      Monday   Nashik     32
1     Tuesday   Nashik     30
2   Wednesday   Nashik     28
3    Thursday   Nashik     22
4      Friday   Nashik     30
5    Saturday   Nashik     20
6      Sunday   Nashik     25
7      Monday   Mumbai     75
8     Tuesday   Mumbai     77
9   Wednesday   Mumbai     75
10   Thursday   Mumbai     82
11     Friday   Mumbai     83
12   Saturday   Mumbai     81
13     Sunday   Mumbai     77
14     Monday     Pune     41
15    Tuesday     Pune     43
16  Wednesday     Pune     45
17   Thursday     Pune     38
18     Friday     Pune     30
19   Saturday     Pune     45
20     Sunday     Pune     47

In [12]:
# vae_name change the name of variable and value_name change the name of value.
melted = pd.melt(df, id_vars=["day"], var_name='city', value_name='temperature')
melted

          day    city  temperature
0      Monday  Nashik           32
1     Tuesday  Nashik           30
2   Wednesday  Nashik           28
3    Thursday  Nashik           22
4      Friday  Nashik           30
5    Saturday  Nashik           20
6      Sunday  Nashik           25
7      Monday  Mumbai           75
8     Tuesday  Mumbai           77
9   Wednesday  Mumbai           75
10   Thursday  Mumbai           82
11     Friday  Mumbai           83
12   Saturday  Mumbai           81
13     Sunday  Mumbai           77
14     Monday    Pune           41
15    Tuesday    Pune           43
16  Wednesday    Pune           45
17   Thursday    Pune           38
18     Friday    Pune           30
19   Saturday    Pune           45
20     Sunday    Pune           47

In [13]:
#Tis will show us variable value.
df1[df1["variable"]=="Pune"]

          day variable  value
14     Monday     Pune     41
15    Tuesday     Pune     43
16  Wednesday     Pune     45
17   Thursday     Pune     38
18     Friday     Pune     30
19   Saturday     Pune     45
20     Sunday     Pune     47